# redis慢查询日志 Slowlog
redis会记录那些查询时间超过指定查询时间的日志

* slowlog-max-len: 慢查询日志长度。如果该长度已经到达最大值，如果有新的命令要记录，会将最老的那条记录删除
* slowlog-log-slower-than: 指定redis执行命令的最大时间，超过这个时间将会记录在慢查询日志里，默认值是10000，单位微妙。如果设置值为0，则记录所有命令。如果小于0，则不记录任何命令。

```bash
redis> config get slowlog-log-slower-than
0 slowlog-log-slower-than
1 10000

redis> config get slowlog-max-len
0 slowlog-max-len
1 128
```

重新设置慢查询
```bash
redis> config set slowlog-log-slower-than 20000
redis> config set slowlog-max-len 1024
redis> config rewrite
```
其中`config rewrite`的作用是将配置写入redis的配置文件

## 查询日志
由于日志是存储在内存中的，因此获取慢查询日志的时候会非常快，但也会造成断电或者重启redis后日志丢失的问题，需要定时将日志落地，例如存在mysql数据库中。

### slowlog get N
获取指定数量的慢查询，返回值：
1. 第一个字段是每个慢查询的唯一标识，是个自增的number值
1. 处理完命令后，unix时间戳
1. 所执行的命令的耗时
1. 所执行的命令
```bash
redis> slowlog get 2

redis> slowlog get 2
  10
  1524122487
  25533
    sadd
    test
    test1
    test2
    test3
  9
  1523603100
  19019
    sadd
    test
    test1
    test2
    test3
```

### slowlog len
查询当前日志的长度
```bash
redis> slowlog len
11
```

### slowlog reset
慢日志重置
```bash
redis> slowlog reset
ok
```

参考资料：
[Redis高级功能 - 慢查询日志](https://segmentfault.com/a/1190000009915519)